---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionUserDefined
source: html/268fa8b9-7aee-f406-5e72-930edb3900ab.htm
---
# StructuralSectionUserDefined Members

Creates a new instance of Structural Section User Defined shape with the associated set of parameters,
 used to attach to structural element.